byYorick/mesh_hydro/root_node/sdkconfig.defaults
# ROOT NODE Configuration

# WiFi Configuration
CONFIG_WIFI_SSID="MyWiFi"
CONFIG_WIFI_PASSWORD="MyWiFiPassword"

# MQTT Configuration
CONFIG_MQTT_BROKER_URI="mqtt://192.168.1.100:1883"

# Mesh Configuration
CONFIG_MESH_ENABLE=y
CONFIG_MESH_ROOT_ENABLE=y

# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

